app/Controllers/AdminController.php

    public function admin()
    {
        $userModel = new UserModel();

        // Ambil data pengguna dengan peran "admin"
        $admin = $userModel->where('role', 'admin')->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'admin'