app/Controllers/BarangController.php

SELECT *
FROM `barang`
---
    public function index()
    {
        $barangModel = new BarangModel();
        $data['barangs'] = $barangModel->findAll(); // Menggunakan metode findAll() untuk mendapatkan semua data barang