app/Controllers/PeminjamanController.php

SELECT *
FROM `peminjaman`
---
    public function index()
    {
        $peminjamanModel = new PeminjamanModel();
        $data['peminjaman'] = $peminjamanModel->findAll();

SELECT *
FROM `barang`
---
    public function daftarBarang()
    {
        $barangModel = new BarangModel;
        $data['barang'] = $barangModel->findAll();

SELECT *
FROM `barang`
WHERE `barang`.`id` = '6'
---
    public function prosesPeminjaman($id)
    {
        $barangModel = new BarangModel();
        $data['barang'] = $barangModel->find($id);

INSERT INTO `peminjaman` (`user_id`, `barang_id`, `nama`, `nim`, `no_telepon`, `tanggal_mulai`, `tanggal_selesai`, `tujuan`, `status`) VALUES ('2', '6', 'anu', 'anu', '124', '2023-07-15', '2023-07-15', 'ldknsld', 'Sedang Dipinjam')
---
            'status' => $status
        ];

        $peminjamanModel->insert($data);