app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'adit@gmail.com'
 LIMIT 1
---
    public function getUserByUsername($email)
    {
        return $this->where('email', $email)->first();